# Проект: Анализ резюме из HeadHunter



## Оглавление  
[1. Описание проекта](.README.md#Описание-проекта)  
[2. Какой кейс решаем?](.README.md#Какой-кейс-решаем)  
[3. Краткая информация о данных](.README.md#Краткая-информация-о-данных)  
[4. Этапы работы над проектом](.README.md#Этапы-работы-над-проектом)  
[5. Результат](.README.md#Результат)    
[6. Выводы](.README.md#Выводы) 

### Описание проекта    
Компания HeadHunter хочет построить модель, которая бы автоматически определяла примерный уровень заработной платы, подходящей пользователю, исходя из информации, которую он указал о себе. 

:arrow_up:[к оглавлению](_)


### Какой кейс решаем?    
Компания HeadHunter хочет построить модель, которая бы автоматически определяла примерный уровень заработной платы, подходящей пользователю, исходя из информации, которую он указал о себе.  

**Метрики качества**
* Решение оформляется только в Jupyter Notebook.  
* Решение оформляется в соответствии с ноутбуком-шаблоном.  
* Каждое задание выполняется в отдельной ячейке, выделенной под задание (в шаблоне они помечены как ваш код здесь). Не следует создавать множество ячеек для решения задачи — это создаёт неудобства при проверке.  
* Код для каждого задания оформляется в одной-двух jupyter-ячейках (не стоит создавать множество ячеек для решения задачи, это усложняет проверку).  
* Решение должно использовать только пройденный материал: переменные, основные структуры данных (списки, словари, множества), циклы, функции, библиотеки numpy, pandas, matplotlib, seaborn, plotly. Если вы думаете, что для решения необходимо воспользоваться сторонними библиотеками или инструментами (например Excel), другими языками программирования или неизученными конструкциями, вы ошибаетесь :) Все задания решаются с помощью уже знакомых методов.  
* Код должен быть читаемым и понятным: имена переменных и функций отражают их сущность, важно избегать многострочных конструкций и условий.  
* Пользуйтесь руководством PEP 8.  
* Графики оформляются в соответствии с теми правилами, которые мы приводили в модуле по визуализации данных.  
* Обязательное требование: графики должны содержать название, отражающее их суть, и подписи осей.  
* Выводы к графикам оформляются в формате Markdown под самим графиком в отдельной ячейке (в шаблоне они помечены как ваши выводы здесь). Выводы должны быть представлены в виде небольших связанных предложений на русском языке.  

**Что практикуем**     
Учимся писать хороший код на python и визуализировать его.


### Краткая информация о данных:
 0   Пол, возраст                     44744 non-null  object  
 1   ЗП                               44744 non-null  object  
 2   Ищет работу на должность:        44744 non-null  object  
 3   Город, переезд, командировки     44744 non-null  object  
 4   Занятость                        44744 non-null  object  
 5   График                           44744 non-null  object  
 6   Опыт работы                      44576 non-null  object  
 7   Последнее/нынешнее место работы  44743 non-null  object  
 8   Последняя/нынешняя должность     44742 non-null  object  
 9   Образование и ВУЗ                44744 non-null  object  
 10  Обновление резюме                44744 non-null  object  
 11  Авто                             44744 non-null  object  

  
:arrow_up:[к оглавлению](.README.md#Оглавление)


### Этапы работы над проектом  
Проект состоит из 3 этапов:  
1. импорт нужных библиотек  
2. базовый анализ структуры данных    
3. преобразование данных    
4. разведывательный анализ    
5. очистка данных  

:arrow_up:[к оглавлению](.README.md#Оглавление)


### Результаты:  
Результатом работы является датасет, подготовленный для построения модели.

:arrow_up:[к оглавлению](.README.md#Оглавление)


### Выводы:  
Соискатели имеют 4 уровня образования, меньше всего соискателей со средний образованием.  
Среди соискателей только 19% женщин, более активно ищут работу мужчины.  
Средний возраст соискателй 32 года.  
Среди соискателй 37% живут в Москве, 16% в городах - милионниках, 11% в Санкт-Петербурге, 35% в других городах.  Сервис более популярен среди соискателй крупных городав. При этом только 32% соискателей готовы и к переезду, и к командировкам.  
Более половины соискателей расчитывают на заработную плату от 59 тыс. руб. Большинство соискателй не рассчитывают на заработную плату более 200 тыс. руб.   
Большинству соискателей  до 50 лет, половине из них 30 лет. 
Стаж работы большинства соискателей составляет от 12,5 до 33 лет.  
Чем выше уровень образования и опыт работы, тем выше ожидаемая заработная плата.  
Самые большие ожидания по заработной плате наблюдаются у соискателей из Москвы.  
Кроме того большую заработную плату ожидают соискатели готовые и к командировкам, и к переезду.  
Большинству соискателей, готовых и к переезду, и к командировкам от 23 до 35 лет.  
Соискатели должностей, рынок по которым пресыщен ожидают меньшую заработную плату, чем соискатели редких профессий.  
Датасет очищен от дубликатов.
Часть отсутствующих значений об опыте работы заполнено медианным значением.  
Так же датасет содержит данные, которые можно отнести к выбросам в количестве 3 ед.


:arrow_up:[к оглавлению](.README.md#Оглавление)
